app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1401]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = $1  [["director", "George Lucas"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = $1  [["director", "Christopher Nolan"]]
---
    def samedirector_movies
    @movie = Movie.find(params[:id])
    if @movie.director == "" || @movie.director == nil    #no info about director(sad path)
      flash[:notice] = "\'" + @movie.title + "\' has no director info"
      redirect_to '/movies' and return
    end
    @movies_made_by_same_director = @movie.movies_made_by_same_director
    if @movies_made_by_same_director.empty?