app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    when 'director'
      ordering,@director_header = {:director => :asc}, 'hilite'
    end

    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

INSERT INTO "movies" ("title", "rating", "director", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1289]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = $1  [["director", "George Lucas"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = $1  [["director", "George Lucas"]]
---
    def samedirector
    @movie = Movie.find(params[:id])
    if @movie.director == nil || @movie.director == ""    #no info about director
      flash[:notice] = "\'" + @movie.title + "\' has no director info"
      redirect_to '/movies' and return
    end
    @movies_with_same_director = @movie.movies_with_same_director
    if @movies_with_same_director.empty?